config.el
;; two alternative keymaps, C-; and C-/
(define-prefix-command 'semicolon-map)
(define-prefix-command 'fs-map)
(global-set-key (kbd "C-;") semicolon-map)
;; (global-set-key (kbd "C-/") fs-map)

;; don't allow execution of (save-buffers-kill-terminal) so easily
(global-unset-key (kbd "C-x C-c"))

(global-set-key (kbd "C-x C-b") #'ibuffer)

(global-set-key (kbd "C-x o") #'ace-window)

(global-set-key (kbd "s-SPC") #'golden-ratio)

(global-set-key (kbd "M-<f12>") #'d/flip-theme)

;; (global-set-key (kbd "M-s") #'avy-goto-char)

(define-key semicolon-map
  (kbd "C-u") #'browse-url)

(defun modi/switch-to-scratch-and-back (&optional arg)
  "Toggle between *scratch-MODE* buffer and the current buffer.
If a scratch buffer does not exist, create it with the major mode set to that
of the buffer from where this function is called.

        COMMAND -> Open/switch to a scratch buffer in the current buffer's major mode
    C-0 COMMAND -> Open/switch to a scratch buffer in `fundamental-mode'
    C-u COMMAND -> Open/switch to a scratch buffer in `org-mode'
C-u C-u COMMAND -> Open/switch to a scratch buffer in `emacs-elisp-mode'

Even if the current major mode is a read-only mode (derived from `special-mode'
or `dired-mode'), we would want to be able to write in the scratch buffer. So
the scratch major mode is set to `org-mode' for such cases.

Return the scratch buffer opened."
  (interactive "p")
  (if (and (or (null arg)               ; no prefix
               (= arg 1))
           (string-match-p "\\*scratch" (buffer-name)))
      (switch-to-buffer (other-buffer))
    (let* ((mode-str (cl-case arg
                       (0  "fundamental-mode") ; C-0
                       (4  "org-mode") ; C-u
                       (16 "emacs-lisp-mode") ; C-u C-u
                       ;; If the major mode turns out to be a `special-mode'
                       ;; derived mode, a read-only mode like `help-mode', open
                       ;; an `org-mode' scratch buffer instead.
                       (t (if (or (derived-mode-p 'special-mode) ; no prefix
                                  (derived-mode-p 'dired-mode))
                              "org-mode"
                            (format "%s" major-mode)))))
           (buf (get-buffer-create (concat "*scratch-" mode-str "*"))))
      (switch-to-buffer buf)
      (funcall (intern mode-str))   ; http://stackoverflow.com/a/7539787/1219634
      buf)))

;; Makes an independent buffer (yanking text of current and putting it in a new one)
;; applies the current mode to the new scratch buffer
(defun make-scratch-buffer-from-current ()
  "Copied the current buffer, open scratch, paste it there."
  (interactive)
  (kill-ring-save (point-min) (point-max))
  (modi/switch-to-scratch-and-back)
  (yank))

(defun kill-help ()
  "Kill help, wherever it is, so you don't have to jump to it."
  (interactive)
  (let ((help-buff (get-buffer "*Help*")))
    (when (buffer-live-p help-buff)
      (kill-buffer help-buff))))

(use-package csound-mode
  :ensure t)

(use-package dired-rsync
  :ensure t)

;; these both have essential nice functions for elisp
(use-package s :ensure t)		;string manip
(use-package f :ensure t)		;file manip

(require 'f)				;used several times in init

(require 'server)
(unless (server-running-p)
  (server-start))

;; get rid of greeting screen
;;(setq inhibit-startup-message t)

;; declutter view
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
;; (display-battery-mode 1)
;; (display-time-mode 1)
(setq inhibit-startup-screen 1)

;; show column numbers
(column-number-mode)

;; enable cursorline
(global-hl-line-mode t)

;; globally preffiy symbols e.g. <=, or, lambda, ...
(global-prettify-symbols-mode t) 

;; highlight matching paren when point is on top of one. Applies to braces, brackets, etc.
(show-paren-mode 1)

;; x clipboard support
(setq select-enable-clipboard t)
(setq x-select-enable-clipboard-manager t)

;; C-; C-q open recent files
(recentf-mode)
(define-key semicolon-map (kbd "C-q") 'recentf-open-files)

(setq ring-bell-function 'ignore)

;; alias yes-or-no-p function to y-or-n-p function
(defalias 'yes-or-no-p 'y-or-n-p)

;; leave off unless and locally set to t dependent on language.
;; (setq-default indent-tabs-mode nil)

;; make 80 the horizontal char limit
(setq-default fill-column 80)

;; default window dimensions 130x150 and 200 pixels down. X unspecified. This
;; works for emacsclient as well
(when (display-graphic-p)
  (setq default-frame-alist
	'((width . 130)
	  (height . 150)
	  (top . 200))))

;; make firefox-developer-edition default browser
(setq browse-url-generic-program "firefox-developer-edition"
      browse-url-browser-function #'browse-url-generic)

(setq enable-recursive-minibuffers t)

(add-to-list 'auto-mode-alist '("\\.service\\'" . conf-mode))
(add-to-list 'auto-mode-alist '("\\.rules\\'" . conf-mode))
(add-to-list 'auto-mode-alist '("\\.bashrc\\'" . shell-script-mode))
(add-to-list 'auto-mode-alist '("\\.zshrc\\'" . shell-script-mode))
(add-to-list 'auto-mode-alist '("\\.yml\\'" . conf-mode))

;; not autosave and no lock files. But do backup to specific dir
(setq make-backup-files t
      auto-save-default nil
      create-lockfiles nil)

(when (not (f-exists? "~/.emacs.d/backups"))
      (mkdir "~/.emacs.d/backups"))

(setq backup-by-copying t
      backup-directory-alist
      '(("." . "~/.emacs.d/backups"))
      delete-old-versions t
      kept-new-versions 3
      kept-old-versions 2
      version-control t)

(winner-mode)

;; vim style bindings
(define-key winner-mode-map (kbd "C-w C-h") 'winner-undo)
(define-key winner-mode-map (kbd "C-w C-l") 'winner-redo)

;; avy for faster navigation inside and outside buffers
(use-package avy
  :ensure t)

;; a non-directional way to switch windows
(use-package ace-window
  :ensure t
  :init
  (setq aw-keys '(?h ?j ?k ?l ?a ?s ?d ?f)))

;resizes windows to the golden ratio
(use-package golden-ratio
  :ensure t)

;; (use-package markdown-mode
;;   :ensure t
;;   :mode (("README\\.md\\'" . gfm-mode)
;;          ("\\.md\\'" . markdown-mode)
;;          ("\\.markdown\\'" . markdown-mode))
;;   :init
;;   (setq markdown-command "pandoc -s --quiet"))
