config.el

(use-package diminish
  :ensure t)

;; reminds you of common commands formable from key prefixes when you type
(use-package which-key
  :ensure t
  :config
  (which-key-mode)
  (diminish 'which-key-mode)
  :after
  (diminish))

;; easily see cursor
(use-package beacon
  :ensure t
  :config
  (beacon-mode 1)
  (diminish 'beacon-mode)
  :after (diminish))

(use-package rainbow-delimiters
  :ensure t
  :init
  (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package rainbow-mode
  :ensure t)

;; (use-package gruvbox-theme :ensure t)
;; (use-package modus-operandi-theme :ensure t :config (load-theme 'modus-operandi t))
;; (use-package modus-vivendi-theme :ensure t)

;; (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/gruvbox")


(add-to-list 'load-path "~/.emacs.d/small-mods/")
(require 'better-theme-switching)
(d/make-theme light-theme 'leuven
	      ;; blue and white ivy selection
	      (custom-set-faces '(ivy-current-match ((((class color) (background light))
						      (:background "#1a4b77" :foreground "white" :extend t))
						     (((class color) (background dark))
						      (:background "#65a7e2" :foreground "black" :extend t)))))
	      (mapc #'disable-theme custom-enabled-themes) ;disable all themes currently enabled
	      (setq theme-state 'light)			   ;for use by `d/flip-theme'
	      (message "==loaded light theme")
	      )

(d/make-theme dark-theme 'spacemacs-dark
	      (custom-set-faces
	       ;; bright green ivy selection
	       '(ivy-current-match ((t (:foreground "chartreuse3" :underline t :weight bold)))))

	      (mapc #'disable-theme custom-enabled-themes)
	      (setq theme-state 'dark)
	      (message "==loaded dark theme")
	      )
(d/load-theme dark-theme)

;; C, C++, Objective-C completion
;; this takes care of loading the irony server as well. It integrates with
;; company
(use-package company-irony
  :ensure t
  :after (company)
  :config
  (require 'irony)
  (add-hook 'c++-mode-hook #'irony-mode)
  ;; (add-hook 'c-mode-hook #'irony-mode)
  (add-hook 'objc-mode-hook #'irony-mode)
  (add-hook 'irony-mode-hook #'irony-cdb-autosetup-compile-options)
  (add-to-list 'company-backends #'company-irony))

;; eldoc support in c modes
(use-package irony-eldoc
  :ensure t
  :after (company-irony)
  :config (add-hook 'irony-mode-hook #'irony-eldoc))

;; (add-hook 'c-mode-hook
	  ;; #'irony-mode)


(defvar fs-c-mode-map
  (let ((map (make-sparse-keymap)))
    (set-keymap-parent map fs-map)
    map)
  "Overrides `fs-map' in c-mode buffers")
(define-prefix-command 'fs-c-mode-map)

;; look up man page at point
(define-key fs-c-mode-map (kbd "C-h") #'man-follow) ; C-/ C-h for man follow


(add-hook 'c-mode-hook
	  #'(lambda ()
	      (local-set-key (kbd "C-x u") nil) ;don't overwrite this
	      (local-set-key (kbd "C-/") fs-c-mode-map)
	      ))

;; (setq c-default-style "k&r")
(require 'cc-vars)
(push '(c-mode . "k&r") c-default-style)

(use-package web-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.ejs\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))

  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2))

(use-package company-web
  :ensure t
  :after (company web-mode)
  :config
  (add-to-list 'company-backends #'company-web-html)
  ;; (add-hook 'html-mode #'company-web-html)
  (define-key web-mode-map (kbd "C-c C-.") 'company-web-html)
  (add-to-list 'company-backends #'company-css)
  )


;; (add-hook 'html-mode-hook
;;           #'(lambda ()
;;               (define-key html-mode-map
;;                 (kbd "C-c C-.")
;;                 #'company-web-html)))

;; (use-package slime-company
;;   :ensure t)
(add-hook 'slime-mode-hook
          #'(lambda ()
              (setq-local fill-column 100)))

;; in buffer completion framework
(use-package company
  :ensure t
  :config
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  ;; C-; C-/ - force company mode file path completion
  (define-key semicolon-map
    (kbd "C-/")
    #'company-files)

  (global-company-mode 1)
  (diminish 'company-mode)
  :after (diminish))

(setq company-minimum-prefix-length 3)
(setq company-tooltip-limit 15)
;; if idle delay is non-nil, tramp will hang a lot.
(setq company-default-idle-delay 0.05)
(setq company-idle-delay company-default-idle-delay)

(defun toggle-company-idle-delay ()
  (interactive)
  (message "Company Idle Delay %s"
           (propertize (format "%s"
                               (if company-idle-delay
                                   (setq company-idle-delay nil)
                                 (setq company-idle-delay company-default-idle-delay)))
                       'face '(:foreground "#00FFFF"))))

(use-package ivy
  :ensure t
  :config
  (ivy-mode 1)
  (setq ivy-height 32)                  ;32 candidates
  (global-set-key (kbd "C-x b") #'ivy-switch-buffer)
  (global-set-key (kbd "C-c C-r") #'ivy-resume)

  (setq ivy-use-virtual-buffers t)

  (diminish 'ivy-mode)
  :after (diminish))

(use-package swiper
  :ensure t
  :config
  (setq ivy-use-group-face-if-no-groups nil) ;weird error if you don't do this
  :after (ivy))

(use-package counsel
  :ensure t
  :config
  (setq counsel-find-file-at-point t)
  (global-set-key (kbd "C-x C-f") #'counsel-find-file)
  (global-set-key (kbd "M-x") #'counsel-M-x)
  (global-set-key (kbd "C-h v") #'counsel-describe-variable)
  (global-set-key (kbd "C-h f") #'counsel-describe-function)
  (global-set-key (kbd "C-h l") #'counsel-find-library)
  (global-set-key (kbd "C-h S") #'counsel-info-lookup-symbol)
  (global-set-key (kbd "C-s") #'counsel-grep-or-swiper)
  (global-set-key (kbd "C-x r b") #'counsel-bookmark)
  (global-set-key (kbd "C-x r i") #'counsel-register)

  (define-key semicolon-map
    (kbd "C-s") #'counsel-ag)
  (define-key semicolon-map
    (kbd "C-f") #'counsel-fzf)
  :after (ivy swiper))
