config.el

(setq dired-listing-switches "-al --human-readable")

;; additional dired functionality. Comes with emacs
(require 'dired-x)

;; collapses dirs having only 1 item, but still displays the collapsed dir so
;; that you can see the full relative path
;; TODO: this breaks 'j' -> `dired-goto-file' functionality for collapsed dirs
;; (use-package dired-collapse
  ;; :ensure t
  ;; :config (add-hook 'dired-mode-hook #'dired-collapse-mode))

(use-package dired-quick-sort
  :ensure t
  :config (dired-quick-sort-setup))     ;binds S to hyrda sort dispatcher

(setq dired-dwim-target t)

;; (setq dired-omit-mode t)                ;this hides .elc among others

;; simple function to toggle display of dotfiles in dired
(defun dired-dotfiles-toggle ()
  "Show/hide dot-files"
  (interactive)
  (when (equal major-mode 'dired-mode)
    (if (or (not (boundp 'dired-dotfiles-show-p)) dired-dotfiles-show-p) ; if currently showing
	(progn 
	  (set (make-local-variable 'dired-dotfiles-show-p) nil)
	  (message "h")
	  (dired-mark-files-regexp "^\\\.")
	  (dired-do-kill-lines))
      (progn (revert-buffer) ; otherwise just revert to re-show
	     (set (make-local-variable 'dired-dotfiles-show-p) t)))))

(defvar fs-dired-mode-map
  (let ((map (make-sparse-keymap)))
    (set-keymap-parent map fs-map)
    map)
  "Overrides `fs-map' in dired-mode buffers")
(define-prefix-command 'fs-dired-mode-map)

(define-key fs-dired-mode-map (kbd "C-d") #'dired-dotfiles-toggle)

(add-hook 'dired-mode-hook
	  #'(lambda ()
	      (local-set-key (kbd "C-/") fs-dired-mode-map)))

(setq doc-view-resolution 300)

;; for viwing pdfs and other things. NOTE, pdf-tools-install only installs when
;; not already installed, so this is fine.
;; TODO: for some reason, pdf-tool-install was breaking (doc-view-toggle-display)
;; (use-package pdf-tools
  ;; :ensure t
  ;; :config
  ;; (pdf-tools-install)
  ;; )

(setq global-eldoc-mode t)
(setq eldoc-idle-delay 0.05)        ;reduce time it takes for eldoc to pop up
(setq eldoc-print-after-edit nil)   ;documentation is show even when not editing
(setq irony-eldoc-use-unicode nil)  ;OFF: use ∷ and ⇒ instead of :: and =>

(custom-set-faces
 '(eldoc-highlight-function-argument ((t (:inherit bold
						   :foreground "#98971a"
						   :height 1.3)))))

(add-hook 'eshell-mode-hook
	  #'(lambda ()
	      ;; don't auto complete with company
	      (setq-local company-idle-delay nil)
	      ;; use default completion instead of pcomplete
	      ;; (define-key eshell-mode-map (kbd "<tab>") #'completion-at-point)
	      ))
(setq eshell-prefer-lisp-functions nil)

; tab completion in eshell
(setq eshell-cmpl-cycle-completions nil)

;; more quickly traverse to parent directories with regexp match over ../../../../
(use-package eshell-up
  :ensure t)

(add-to-list 'load-path "~/.emacs.d/eshell-ring/")
(require 'eshell-ring)
(global-eshring-mode 1)

(require 'eshell-mods "~/.emacs.d/eshell-mods")

(setq eshell-aliases-source "~/.zshrc")

(defun write-eshell-aliases () 
  (interactive)
  (f-write (eshell-parse-aliases eshell-aliases-source
				 '(("ls" . ("--classify"
					    "--color=[[:word:]]+"))
				   ("top" . nil))
				 ;; "alias top (helm-top)"
				 "alias up eshell-up $1"
				 "alias pk eshell-up-peek $1")
	   'utf-8 eshell-aliases-file))

;;;; sudo completion
(defun pcomplete/sudo ()
  "Completion rules for the `sudo' command."
  (let ((pcomplete-ignore-case t))
    (pcomplete-here (funcall pcomplete-command-completion-function))
    (while (pcomplete-here (pcomplete-entries)))))

;;;; systemctl completion
(defcustom pcomplete-systemctl-commands
  '("disable" "enable" "status" "start" "restart" "stop" "reenable"
    "list-units" "list-unit-files")
  "p-completion candidates for `systemctl' main commands"
  :type '(repeat (string :tag "systemctl command"))
  :group 'pcomplete)

(defvar pcomplete-systemd-units
  (split-string
   (shell-command-to-string
    "(systemctl list-units --all --full --no-legend;systemctl list-unit-files --full --no-legend)|while read -r a b; do echo \" $a\";done;"))
  "p-completion candidates for all `systemd' units")

(defvar pcomplete-systemd-user-units
  (split-string
   (shell-command-to-string
    "(systemctl list-units --user --all --full --no-legend;systemctl list-unit-files --user --full --no-legend)|while read -r a b;do echo \" $a\";done;"))
  "p-completion candidates for all `systemd' user units")

(defun pcomplete/systemctl ()
  "Completion rules for the `systemctl' command."
  (pcomplete-here (append pcomplete-systemctl-commands '("--user")))
  (cond ((pcomplete-test "--user")
	 (pcomplete-here pcomplete-systemctl-commands)
	 (pcomplete-here pcomplete-systemd-user-units))
	(t (pcomplete-here pcomplete-systemd-units))))

;;;; man completion
(defvar pcomplete-man-user-commands
  (split-string
   (shell-command-to-string
    "apropos -s 1,3 .|while read -r a b; do echo \" $a\";done;"))
  "p-completion candidates for `man' command")

(defun pcomplete/man ()
  "Completion rules for the `man' command."
  (pcomplete-here pcomplete-man-user-commands))

(shell-command-to-string "man man")

(add-hook 'shell-mode-hook
          #'(lambda ()
              ;; don't use company for auto completion
              (setq-local company-idle-delay nil)))

(use-package undo-tree
  :load-path "~/.emacs.d/undo-tree/"
  :ensure t
  :init
  (when (not (f-exists? "~/.emacs.d/undo-tree-hist"))
    (mkdir "~/.emacs.d/undo-tree-hist"))
  :config
  (global-undo-tree-mode 1)

  (defalias #'redo #'undo-tree-redo)
  (defalias #'undo #'undo-tree-undo)

  ;; sets directory where persistent undo history is stored
  (setq undo-tree-history-directory-alist
        '(("." . "~/.emacs.d/undo-tree-hist")))
  (setq undo-tree-auto-save-history t)
  (setq undo-tree-visualizer-diff t)
  (setq undo-tree-visualizer-timestamps t)

  ;; evil provides bindings for these, so they're unnecessary
  (define-key undo-tree-map (kbd "C-/") nil)
  (define-key undo-tree-map (kbd "C-_") nil)
  (define-key undo-tree-map (kbd "M-_") nil)
  (diminish 'undo-tree-mode)
  :after (diminish))

(add-to-list 'load-path "~/.emacs.d/evil-numbers/")
