config.org
** evil
#+BEGIN_SRC emacs-lisp
  (require 'evil-numbers)

  (use-package evil
    :ensure t
    :init
    (setq evil-want-C-u-scroll t  ;set C-u to function as scroll up in evil mode
	  evil-want-C-i-jump nil  ;this should fix issues with evil tabbing in org
	  evil-want-fine-undo t   ;finer granularity for undo
	  evil-want-Y-yank-to-eol t   ;Y yanks to eol instead of stupid whole line
	  ;; evil-want-minibuffer t
	  )
    ;; Normally bound to `upcase-word', but evil provides gUaw and
    ;; `universal-argument' is more important
    (global-set-key (kbd "M-u") #'universal-argument)
    :config
    (evil-mode 1)
    (setq evil-echo-state nil) ;turn off -- INSERT --, -- VISUAL --, because it ruins eldoc.

    ;; INSERT STATE
    ;; escape from insert state with M-i
    (define-key evil-insert-state-map
      (kbd "M-i") #'evil-normal-state)
    ;; VISUAL STATE
    (define-key evil-visual-state-map
      (kbd "M-i") #'evil-normal-state)
    ;; NORMAL STATE
    ;; set vimish-fold-avy as default action for zf
    (define-key evil-normal-state-map
      (kbd "zf") #'vimish-fold-avy)
    (define-key evil-normal-state-map
      (kbd "M-a") #'evil-avy-goto-line)
    (define-key evil-normal-state-map
      (kbd "M-i") #'evil-normal-state-map)
    ;; don't overwrite `xref-find-definitions'
    (define-key evil-normal-state-map
      (kbd "M-.") nil)
    ;; evil-numbers increment and decrement functionality
    (define-key evil-normal-state-map
      (kbd "C-c C-=") #'evil-numbers/inc-at-pt)
    (define-key evil-normal-state-map
      (kbd "C-c +") #'evil-numbers/inc-at-pt)
    (define-key evil-normal-state-map
      (kbd "C-c C--") #'evil-numbers/dec-at-pt)
    ;; MOTION STATE
    ;; have already redefined C-u to `evil-scroll-page-up'
    (define-key evil-motion-state-map
      (kbd "C-b") nil)

    ;; tell evil to not run in these modes
    (nconc evil-emacs-state-modes
	   '(dired-mode)
	   '(image-mode)
	   '(ivy-occur-mode)
	   '(epa-key-list-mode epa-key-mode epa-info-mode) ;easy pgp
	   )

    ;; force nomral evil state in these modes
    (require 'ivy)
    (setq evil-normal-state-modes
	  '(grep-mode			;so we can use evil to edit with `wgrep'
	    ivy-occur-grep-mode		;so the above works in counsel-ag too
	    ))

    :after (ivy))

  ;; vimish fold
  (use-package vimish-fold
    :ensure t)

  ;; evil keybindings to vimish fold zf, za, zd, &c
  (use-package evil-vimish-fold
    :ensure t
    :after (vimish-fold)
    :config
    (evil-vimish-fold-mode)
    (diminish 'evil-vimish-fold-mode)
    :after (diminish evil))
#+END_SRC
** flyspell
- ~[s~ -> goto previous flyspell error
- ~]s~ -> goto next flyspell error
- ~z=~ -> ispell-word
#+BEGIN_SRC emacs-lisp
  ;; auto start flyspell on non programming buffers
  (add-hook 'org-mode-hook #'flyspell-mode)
  (add-hook 'text-mode-hook #'flyspell-mode)

  (require 'flyspell)
  (define-key flyspell-mode-map (kbd "C-;") nil)
  (define-key flyspell-mode-map (kbd "C-M-i") nil)
  (define-key flyspell-mode-map (kbd "C-,") nil)
  (define-key flyspell-mode-map (kbd "C-c $") nil)

  ;; ;; so we need a hook
  ;; (add-hook 'flyspell-mode-hook
  ;;           #'(lambda ()
  ;;               (define-key flyspell-mode-map (kbd "C-;") nil)
  ;;               (define-key flyspell-mode-map (kbd "C-M-i") nil)
  ;;               (define-key flyspell-mode-map (kbd "C-,") nil)
  ;;               (define-key flyspell-mode-map (kbd "C-c $") nil)))

#+END_SRC
** ido                                                             :disabled:
#+BEGIN_SRC emacs-lisp :tangle no
  (require 'ido)
  (require 'ido-hacks "~/.emacs.d/ido-hacks/ido-hacks")
  (ido-mode 1)
  (ido-hacks-mode)

  ;; friendship's over with helm.
  (setq ido-enable-flex-matching t
        ido-everywhere t
        ido-use-filename-at-point 'guess
        ido-create-new-buffer 'always
        ido-virtual-buffers t
        ido-max-window-height 0.25
        ido-show-dot-for-dired t          ;first item is always dired
        ido-use-url-at-point t)

  (setf (elt ido-decorations 2) "\n"
        (elt ido-decorations 3) "\n")

  ;; C-n/C-p for next/prev completion
  (define-key ido-common-completion-map (kbd "C-n") #'ido-next-match)
  (define-key ido-common-completion-map (kbd "C-p") #'ido-prev-match)

  ;; for ido in M-x
  (use-package smex
    :ensure t
    :config
    (global-set-key (kbd "M-x") #'smex))

  ;; also, consider using ivy.
#+END_SRC
** magit
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t)
#+END_SRC
** org
*** hook
#+NAME:org-hook-vars
#+BEGIN_SRC emacs-lisp :tangle no
  ;; redefines org's definition of paragraph start and end to be compatible with
  ;; evil mode's notion of "a paragraph"
  ;; (setq paragraph-start "\\|[ 	]*$"
  ;;       paragraph-separate "[ 	]*$")

  ;; (setq fill-column 100)
#+END_SRC

#+NAME:org-hook-funs
#+BEGIN_SRC emacs-lisp :tangle no
  (defun org-insert-today ()
                "Inserts todays date in the following form <1969-12-31 Wed>"
                (interactive)
                (insert (format-time-string "<%Y-%m-%d %a>" (current-time))))

  (define-skeleton org-mode-html-header
    "Inserts skeleton fitting most org-mode files which export to HTML"
    ""
    (format "#+TITLE: %12s\n" (read-string "Title: "))
    "#+AUTHOR:\n"
    "#+EMAIL: nil\n"
    (format "#+DATE: %s\n" (format-time-string "<%Y-%m-%d %a>" (current-time)))
    "#+LANGUAGE: en"\n
    (if (y-or-n-p "Custom stylesheet?")
        (format "#+HTML_HEAD: <link rel='stylesheet' type='text/css' href='%s'\n%s\n"
                (file-relative-name (read-file-name "path: " ) default-directory)
                "#+OPTIONS: html-style:nil")
      "#+OPTIONS: html-style:t\n")
    "#+OPTIONS: toc:t"\n
    "#+OPTIONS: tex:t"\n
    "#+OPTIONS: html-postamble:nil"\n
    (let ((todo-kwords ""))
      (loop for kword in (cdar org-todo-keywords)
            do (setq todo-kwords (s-concat todo-kwords " " kword)))
      (format "#+TODO: %s\n" todo-kwords))
    "#+PROPERTY: header-args :results output")
#+END_SRC

#+BEGIN_SRC emacs-lisp :noweb yes
  (add-hook 'org-mode-hook
	    (lambda ()
	      <<org-hook-vars>>
	      (auto-fill-mode 1) ;automatically break line at `current-fill-column'
	      <<org-hook-funs>>))
#+END_SRC

*** general
#+BEGIN_SRC emacs-lisp
  (define-key org-mode-map
    (kbd "C-c C-'")
    'org-babel-expand-src-block)

  (setq org-babel-python-command "python3")

  (org-babel-do-load-languages 'org-babel-load-languages
   '((python . t)
     (C . t)
     ;; (R . t)
     ;; (dot . t)
     (lisp . t)
     (shell . t)
     ;; (awk . t)
     ;; (sed . t)
     (emacs-lisp . t)
     ;; (sql . t)
     ;; (js . t)
     ))

  ;; sets where org-edit-special takes you (C-c ')
  (setq org-src-window-setup 'current-window)

  ;; function (org-show-block-all)
  ;; choose to hide or show blocks on startup
  (setq org-hide-block-startup nil)

  (setq org-todo-keywords
	'((sequence "TODO" "DOING" "DONE")))

  (setq org-todo-keyword-faces
	'(("DOING" . "yellow")))

  (setq org-startup-with-inline-images t)

  ;; don't confirm evaluation of src code block
  (setq org-confirm-babel-evaluate nil)

  ;; used by org to produce html files
  (use-package htmlize
    :ensure t)

  ;; emacs speaks statistics. Not exclusively for org, but this is where I'll use
  ;; it.
  ;; (use-package ess
    ;; :ensure t)

  ;; for drawing graphs. Will only really be used in org-mode
  ;; (use-package graphviz-dot-mode
    ;; :ensure t)
#+end_SRC
** restclient
#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.http\\'" . restclient-mode)))
#+END_SRC
** man
#+BEGIN_SRC emacs-lisp

  ;; man completion
  (defadvice man (before my-woman-prompt activate)
    (interactive (progn
		   (require 'woman)
		   (list (woman-file-name nil)))))
#+END_SRC
** SLIME
Superior Lisp Interaction Mode for Emacs
#+BEGIN_SRC emacs-lisp :noweb yes
  (use-package slime
    :ensure t)

  (defun set-inferior-lisp (name)
    (with-temp-buffer
      (let ((res (shell-command (format "which %s" name) (current-buffer)))
            (output (string-remove-suffix "\n" (buffer-string))))
        (if (= res 0)
            (message "SLIME: inferior lisp, %s, located at %s" name
                     (setq inferior-lisp-program output))
          (message "SLIME: tried to located inferior lisp, %s, but got the following error [%s]"
                   name output)))))

  (set-inferior-lisp "sbcl")

  ;; load "almost all of the popular contribs"
  ;; (setq slime-contribs '(slime-fancy slime-company))

  (slime-setup '(slime-fancy))

  (add-hook 'lisp-mode-hook #'slime-mode)
#+END_SRC
** tramp
#+BEGIN_SRC emacs-lisp
  (setq tramp-default-method "ssh")
#+END_SRC
