config.org
** grep
#+BEGIN_SRC emacs-lisp
  ;; writable `grep'. do a grep and edit it to apply those changes.
  ;; use with `rgrep' to modify multiple files recursively
  (use-package wgrep
    :ensure t)

  ;; wrapper around `ag'
  (use-package wgrep-ag
    :ensure t
    :after (wgrep))
#+END_SRC
** text editing
*** electric paren
#+BEGIN_SRC emacs-lisp
  (setq electric-pair-pairs '((?\( . ?\))
			      (?\[ . ?\])
			      (?\{ . ?\})
			      (?\" . ?\")))
  (electric-pair-mode t)
#+END_SRC
*** yasnippet
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (require 'yasnippet)
    (yas-global-mode 1)
    (diminish 'yas-minor-mode)
    :after (diminish))
#+END_SRC
*** abbrevs                                                        :disabled:
#+BEGIN_SRC emacs-lisp :tangle no
  (read-abbrev-file "~/.emacs.d/abbrevs.el")
  (abbrev-mode 1)
#+END_SRC
* list packages
#+NAME: list packages
#+BEGIN_SRC emacs-lisp :results output exports :code :tangle no
  (dolist (x package-activated-list)
    (print (format "%s" x)))
#+END_SRC

#+RESULTS: list packages
#+begin_example

"ace-window"

"almost-mono-themes"

"avy"

"beacon"

"berrys-theme"

"company-irony"

"company-jedi"

"company-web"

"counsel"

"diminish"

"dired-collapse"

"dired-hacks-utils"

"dired-quick-sort"

"editorconfig"

"eshell-up"

"evil-numbers"

"evil-vimish-fold"

"evil"

"golden-ratio"

"goto-chg"

"gruvbox-theme"

"autothemer"

"helm"

"helm-core"

"highlight-indent-guides"

"htmlize"

"hydra"

"irony-eldoc"

"irony"

"jedi-core"

"epc"

"ctable"

"concurrent"

"js2-mode"

"julia-mode"

"lv"

"magit"

"git-commit"

"markdown-mode"

"org-bullets"

"pdf-tools"

"popup"

"pydoc"

"python-environment"

"deferred"

"rainbow-delimiters"

"rainbow-mode"

"restclient"

"slime-company"

"company"

"slime"

"macrostep"

"smex"

"swiper"

"ivy"

"tablist"

"tide"

"flycheck"

"pkg-info"

"epl"

"transient"

"typescript-mode"

"undo-tree"

"use-package"

"bind-key"

"vimish-fold"

"f"

"dash"

"s"

"web-completion-data"

"web-mode"

"which-key"

"with-editor"

"async"

"xelb"

"yasnippet"
#+end_example
