config.el

;; writable `grep'. do a grep and edit it to apply those changes.
;; use with `rgrep' to modify multiple files recursively
(use-package wgrep
  :ensure t)

;; wrapper around `ag'
(use-package wgrep-ag
  :ensure t
  :after (wgrep))

(setq electric-pair-pairs '((?\( . ?\))
			    (?\[ . ?\])
			    (?\{ . ?\})
			    (?\" . ?\")))
(electric-pair-mode t)

(use-package yasnippet
  :ensure t
  :config
  (require 'yasnippet)
  (yas-global-mode 1)
  (diminish 'yas-minor-mode)
  :after (diminish))
